/*
 * File name	: yx_tcpproc.h
 *
 * Created on	: 
 * Author		: 
 * Version		: 
 * Language		: C
 * Copyright	: Copyright 
 *
 */
#ifndef INCLUDE_TCPPROC_H_
#define INCLUDE_TCPPROC_H_

#include "glo_type.h"

/*******************************************************************
** 函数名:     TmrTcpProc
** 函数描述:     链路探寻定时器 接收并回复TCP数据
** 参数:       [in]
** 返回:       负数：错误码 0：无数据 正数：收到数据
********************************************************************/
int TmrTcpProc(void);

/*******************************************************************
** 函数名:     
** 函数描述:TCP通信通道去初始化
** 返回:       true or false
********************************************************************/
BOOL TcpCommReset(void);

/*******************************************************************
** 函数名:     
** 函数描述:   Tcp通道数据发送接口
** 参数:       [in] inBuf: 数据指针
**             [in] inLen: 数据长度
** 返回:       成功返回true，失败返回false
********************************************************************/
int TcpSendData(U8 *inBuf, U16 inLen);

/*******************************************************************
** 函数名:     
** 函数描述:   通道数据接收接口
** 参数:       [out] outBuf: 数据指针
**             [in] maxOutLen: 数据长度
** 返回:       成功返回数据长度，无数据返回错误码
********************************************************************/
int TcpRecvData(U8* outBuf, U32 maxOutLen);

/*******************************************************************
** 函数名:     TcpCommDeInit
** 函数描述:     去初始化
** 参数:       [in] 
** 返回:       true
********************************************************************/
int TcpCommDeInit(void);

/*******************************************************************
** 函数名:     TCPTryConnectServer
** 函数描述:     连接TCP服务器并发送确认
** 参数:       [in] pdata：定时器特征值
** 返回:       无
********************************************************************/
int TCPTryConnectServer(const char* pIPStr, U16 port);

/*******************************************************************
** 函数名:     TCPClientCacheInit
** 函数描述:         TCP 发送缓冲初始化
** 参数:     无
** 返回:       无
********************************************************************/
INT32 TCPClientCacheInit(void);

/*******************************************************************
** 函数名:     StrTestCmdProc
** 函数描述:     处理tcp server的命令
** 参数:       [in] cmd  [in] inBuf [in] inLen [in] outBuf [in] pOutLen
** 返回:     错误码
********************************************************************/
int StrTestCmdProc(U8 cmd, U8 subcmd, U8* pDataBuf, U16 DataLen, U8* pOutBuf, U16* pOutLen);

int TCPClientSendData(U8* inBuf, INT32 inLen);

INT32 TcpDataPackWithProp(U8* inBuf, INT32 inLen, U8* outBuf, INT32 maxOutLen);

#endif /*  */

